#pragma once
// Institutions
const char *Institutes[] = {
    "",                         // 0号位置的占位符
    "哲学社会学院",             // 1
    "文学院",                   // 2
    "外国语学院",               // 3
    "艺术学院",                 // 4
    "体育学院",                 // 5
    "经济学院",                 // 6
    "法学院",                   // 7
    "行政学院",                 // 8
    "商学与管理学院B",          // 9
    "数学学院",                 // 10
    "物理学院",                 // 11
    "化学学院",                 // 12
    "生命科学学院",             // 13
    "机械与航空航天工程学院",   // 14
    "汽车工程学院",             // 15
    "材料科学与工程学院",       // 16
    "交通学院",                 // 17
    "生物与农业工程学院",       // 18
    "电子科学与工程学院",       // 19
    "通信工程学院",             // 20
    "计算机科学与技术学院",     // 21
    "地球科学学院",             // 22
    "地球探测科学与技术学院",   // 23
    "建设工程学院",             // 24
    "新能源与环境学院",         // 25
    "金融学院",                 // 26
    "公共卫生学院",             // 27
    "药学院",                   // 28
    "护理学院",                 // 29
    "东北亚学院",               // 30
    "",                         // 31号位置的占位符
    "",                         // 32号位置的占位符
    "口腔医学院",               // 33
    "商学与管理学院A",          // 34
    "商学与管理学院",           // 35
    "公共外交学院",             // 36
    "新闻与传播学院",           // 37
    "考古学院",                 // 38
    "马克思主义学院",           // 39
    "人工智能学院",             // 40
    "",                         // 41号位置的占位符
    "",                         // 42号位置的占位符
    "",                         // 43号位置的占位符
    "",                         // 44号位置的占位符
    "",                         // 45号位置的占位符
    "",                         // 46号位置的占位符
    "",                         // 47号位置的占位符
    "",                         // 48号位置的占位符
    "",                         // 49号位置的占位符
    "预科教育学院",             // 50
    "",                         // 51号位置的占位符
    "",                         // 52号位置的占位符
    "",                         // 53号位置的占位符
    "应用技术学院",             // 54
    "软件学院",                 // 55
    "",                         // 56号位置的占位符
    "",                         // 57号位置的占位符
    "",                         // 58号位置的占位符
    "",                         // 59号位置的占位符
    "国际语言学院",             // 60
    "",                         // 61号位置的占位符
    "",                         // 62号位置的占位符
    "",                         // 63号位置的占位符
    "",                         // 64号位置的占位符
    "仪器科学与电气工程学院",   // 65
    "",                         // 66号位置的占位符
    "",                         // 67号位置的占位符
    "",                         // 68号位置的占位符
    "",                         // 69号位置的占位符
    "临床医学院",               // 70
    "基础医学院",               // 71
    "",                         // 72号位置的占位符
    "",                         // 73号位置的占位符
    "",                         // 74号位置的占位符
    "白求恩第一临床医学院",     // 75
    "白求恩第二临床医学院",     // 76
    "白求恩第三临床医学院",     // 77
    "",                         // 78号位置的占位符
    "白求恩医学部",             // 79
    "",                         // 80号位置的占位符
    "动物医学学院",             // 81
    "植物科学学院",             // 82
    "军需科技学院",             // 83
    "农学部公共教学中心",       // 84
    "动物科学学院",             // 85
    "",                         // 86号位置的占位符
    "食品科学与工程学院",       // 87
    "学生心理健康指导中心",     // 88
    "军事理论教研室",           // 89
    "创新创业教育学院",         // 90
    "公共外语教育学院",         // 91
    "公共体育教学与研究中心",   // 92
    "公共数学教学与研究中心",   // 93
    "公共物理教学与研究中心",   // 94
    "公共化学教学与研究中心",   // 95
    "公共计算机教学与研究中心", // 96
    "机械基础教学与研究中心",   // 97
    "艺术教学与研究中心",       // 98
    "团委",                     // 99号位置的占位符
};
// 军事理论教研室原本记号为J1，为处理方便，记为89
// 学生心理健康指导中心记号为xz27，记为88

// 校公选课类别
static const char *pubCourseCategory[] = {"", // 非校公选课
                                          "限选大学生心理健康",
                                          "哲学智慧与品判思维(I)",
                                          "大学生职业发展与就业创业指导",
                                          "文化理解与历史传承(II)",
                                          "经济与社会发展类(III)",
                                          "当代中国与公民责任(III)",
                                          "管理与行为科学类(IV)",
                                          "全球视野与文明交流(IV)",
                                          "艺术鉴赏与审美体验(V)",
                                          "工程人文卓越课程类(VII)",
                                          "科学精神与创新创造(VI)",
                                          "科学与技术类(V)",
                                          "生态环境与生命关怀(VII)",
                                          "人际沟通与合作精神(VIII)",
                                          "文学与艺术类(I)",
                                          "创新与创业类(VI)",
                                          "历史与文化类(II)",
                                          "医学人文卓越课程类(VII)",
                                          "慕课"};

// 课程性质
static char *courseType[] = {
    "通识教育课",
    "学科基础课",
    "专业教育课",
    "拓展课",
};

