#include "StuMan_Nouns.h"
#include <string.h>

// Institutions
const char *Institutes[] = {
    "",                            // 0号位置的占位符
    "01-哲学社会学院",             // 1
    "02-文学院",                   // 2
    "03-外国语学院",               // 3
    "04-艺术学院",                 // 4
    "05-体育学院",                 // 5
    "06-经济学院",                 // 6
    "07-法学院",                   // 7
    "08-行政学院",                 // 8
    "09-商学与管理学院B",          // 9
    "10-数学学院",                 // 10
    "11-物理学院",                 // 11
    "12-化学学院",                 // 12
    "13-生命科学学院",             // 13
    "14-机械与航空航天工程学院",   // 14
    "15-汽车工程学院",             // 15
    "16-材料科学与工程学院",       // 16
    "17-交通学院",                 // 17
    "18-生物与农业工程学院",       // 18
    "19-电子科学与工程学院",       // 19
    "20-通信工程学院",             // 20
    "21-计算机科学与技术学院",     // 21
    "22-地球科学学院",             // 22
    "23-地球探测科学与技术学院",   // 23
    "24-建设工程学院",             // 24
    "25-新能源与环境学院",         // 25
    "26-金融学院",                 // 26
    "27-公共卫生学院",             // 27
    "28-药学院",                   // 28
    "29-护理学院",                 // 29
    "30-东北亚学院",               // 30
    "",                            // 31号位置的占位符
    "",                            // 32号位置的占位符
    "33-口腔医学院",               // 33
    "34-商学与管理学院A",          // 34
    "35-商学与管理学院",           // 35
    "36-公共外交学院",             // 36
    "37-新闻与传播学院",           // 37
    "38-考古学院",                 // 38
    "39-马克思主义学院",           // 39
    "40-人工智能学院",             // 40
    "",                            // 41号位置的占位符
    "",                            // 42号位置的占位符
    "",                            // 43号位置的占位符
    "",                            // 44号位置的占位符
    "",                            // 45号位置的占位符
    "",                            // 46号位置的占位符
    "",                            // 47号位置的占位符
    "",                            // 48号位置的占位符
    "",                            // 49号位置的占位符
    "50-预科教育学院",             // 50
    "",                            // 51号位置的占位符
    "",                            // 52号位置的占位符
    "",                            // 53号位置的占位符
    "54-应用技术学院",             // 54
    "55-软件学院",                 // 55
    "",                            // 56号位置的占位符
    "",                            // 57号位置的占位符
    "",                            // 58号位置的占位符
    "",                            // 59号位置的占位符
    "60-国际语言学院",             // 60
    "",                            // 61号位置的占位符
    "",                            // 62号位置的占位符
    "",                            // 63号位置的占位符
    "",                            // 64号位置的占位符
    "65-仪器科学与电气工程学院",   // 65
    "",                            // 66号位置的占位符
    "",                            // 67号位置的占位符
    "",                            // 68号位置的占位符
    "",                            // 69号位置的占位符
    "70-临床医学院",               // 70
    "71-基础医学院",               // 71
    "",                            // 72号位置的占位符
    "",                            // 73号位置的占位符
    "",                            // 74号位置的占位符
    "75-白求恩第一临床医学院",     // 75
    "76-白求恩第二临床医学院",     // 76
    "77-白求恩第三临床医学院",     // 77
    "",                            // 78号位置的占位符
    "79-白求恩医学部",             // 79
    "",                            // 80号位置的占位符
    "81-动物医学学院",             // 81
    "82-植物科学学院",             // 82
    "83-军需科技学院",             // 83
    "84-农学部公共教学中心",       // 84
    "85-动物科学学院",             // 85
    "",                            // 86号位置的占位符
    "87-食品科学与工程学院",       // 87
    "xz27-学生心理健康指导中心",   // 88
    "J1-军事理论教研室",           // 89
    "90-创新创业教育学院",         // 90
    "91-公共外语教育学院",         // 91
    "92-公共体育教学与研究中心",   // 92
    "93-公共数学教学与研究中心",   // 93
    "94-公共物理教学与研究中心",   // 94
    "95-公共化学教学与研究中心",   // 95
    "96-公共计算机教学与研究中心", // 96
    "97-机械基础教学与研究中心",   // 97
    "98-艺术教学与研究中心",       // 98
    "99-团委",                     // 99号位置的占位符
};
// 军事理论教研室原本记号为J1，为处理方便，记为89
// 学生心理健康指导中心记号为xz27，记为88

// 校公选课类别
const char *pubCourseCategory[] = {"", // 非校公选课
                                   "限选大学生心理健康",
                                   "哲学智慧与品判思维(I)",
                                   "大学生职业发展与就业创业指导",
                                   "文化理解与历史传承(II)",
                                   "经济与社会发展类(III)",
                                   "当代中国与公民责任(III)",
                                   "管理与行为科学类(IV)",
                                   "全球视野与文明交流(IV)",
                                   "艺术鉴赏与审美体验(V)",
                                   "工程人文卓越课程类(VII)",
                                   "科学精神与创新创造(VI)",
                                   "科学与技术类(V)",
                                   "生态环境与生命关怀(VII)",
                                   "人际沟通与合作精神(VIII)",
                                   "文学与艺术类(I)",
                                   "创新与创业类(VI)",
                                   "历史与文化类(II)",
                                   "医学人文卓越课程类(VII)",
                                   "慕课"};

const char *Course_type[] = {"", "通识教育课", "学科基础课", "专业教育课", "拓展课"};

const char *Enroll_retake[] = {"", "初修", "重修", "重考"};

const char *Enroll_level[] = {"", "优秀", "良好", "中等", "及格", "不及格"};

const char *Course_nature[] = {"", "必修", "选修", "限选"};

const char *Course_grade_type[] = {"", "百分制", "五级制"};

const char *Course_exam_type[] = {"", "考试", "考察"};

const char *Professions[88][15] = {
    {""},                                                                                   // 0
    {"哲学（匡亚明班，拔尖学生培养基地）", "哲学", "社会学", "社会工作", "劳动与社会保障"}, // 1
    {"汉语言文学", "历史学"},                                                               // 2
    {"英语", "俄语", "俄语(高校专项计划)", "西班牙语", "日语", "朝鲜语",
     "朝鲜语(高校专项计划)"}, // 3
    {"音乐表演(艺术专业)", "绘画(艺术专业)", "设计学", "视觉传达设计", "环境设计",
     "产品设计(艺术专业)"},                                       // 4
    {"社会体育指导与管理"},                                       // 5
    {"经济学类", "经济学", "财政学", "金融学", "国际经济与贸易"}, // 6
    {"法学"},                                                     // 7
    {"政治学与行政学", "国际政治", "行政管理"},                   // 8
    {"会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
     "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用",
     "档案学"},                                                                            // 9
    {"数学类", "数学与应用数学", "信息与计算科学", "统计学"},                              // 10
    {"物理学类", "应用物理学", "核物理", "光电信息科学与工程", "物理学（中外合作办学） "}, // 11
    {"化学类", "应用化学", "材料化学", "高分子材料与工程", "化学工程与工艺"},              // 12
    {"生物科学类", "生物技术", "生物工程类", "生物制药", "药物制剂"},                      // 13
    {"机械工程（饶斌班，本研贯通）", "机械工程", "工业工程", "工程力学", "智能制造工程"},  // 14
    {"车辆工程（饶斌班，本研贯通）", "车辆工程", "工业设计", "能源与动力工程"},            // 15
    {"材料类", "材料科学与工程 ", "无机非金属材料工程", "材料成型及控制工程", "材料物理",
     "材料物理(高校专项计划)"}, // 16
    {"交通运输类", "交通运输", "交通工程", "汽车服务工程", "道路桥梁与渡河工程", "物流工程",
     "农业机械化及其自动化（饶斌班，本研贯通）", "农业机械化及其自动化", "仿生科学与工程"}, // 17
    {"农林经济管理"},                                                                       // 18
    {"电子信息类", "电子信息工程", "电子科学与技术", "微电子 科学与工程",
     "电子信息科学与技术"}, // 19
    {"通信工程类", "通信工程(国家专项计划)", "信息工程", "空间信息与数字技术", "自动化",
     "机器人工程"},                                                             // 20
    {"计算机科学与技术", "物联网工程", "网络空间安全"},                         // 21
    {"地质类", "地质学", "资源勘查工程", "土地资源管理"},                       // 22
    {"勘查技术与工程勘查技术与工程", "地理信息科学", "地球物理学", "测绘工程"}, // 23
    {"土木类", "土木工程", "地质工程"},                                         // 24
    {"水利类", "水文与水资源工程", "地下水科学与工程", "环境科学与工程", "环境科学", "环境工程",
     "环境工程(高校专项计划)", "新能源科学与工程"}, // 25
    {""},                                           // 26
    {"放射医学", "预防医学"},                       // 27
    {"药学", "临床药学"},                           // 28
    {"康复治疗学", "护理学"},                       // 29
    {"经济学（国别与区域经济）", "应用心理学", "经济学（匡亚明班，拔尖学生培养基地 ）",
     "政治学与行政学政治学与行政学"},      // 30
    {""},                                  // 31
    {""},                                  // 32
    {"口腔医学", "口腔医学（5+3一体化）"}, // 33
    {"会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
     "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用",
     "档案学"}, // 34
    {"会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
     "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用",
     "档案学"},                                                                             // 35
    {"外交学"},                                                                             // 36
    {"新闻传播学类", "新闻学", "广告学", "广播电 视编导"},                                  // 37
    {"考古学", "文物与博物馆学"},                                                           // 38
    {"马克思主义理论（吕振羽班，本研贯通）", "马克思主义理论", "思想政治教育"},             // 39
    {"人工智能"},                                                                           // 40
    {""},                                                                                   // 41
    {""},                                                                                   // 42
    {""},                                                                                   // 43
    {""},                                                                                   // 44
    {""},                                                                                   // 45
    {""},                                                                                   // 46
    {""},                                                                                   // 47
    {""},                                                                                   // 48
    {""},                                                                                   // 49
    {""},                                                                                   // 50
    {""},                                                                                   // 51
    {""},                                                                                   // 52
    {""},                                                                                   // 53
    {""},                                                                                   // 54
    {"软件工程", "数据科学与大数据技术"},                                                   // 55
    {""},                                                                                   // 56
    {""},                                                                                   // 57
    {""},                                                                                   // 58
    {""},                                                                                   // 59
    {""},                                                                                   // 60
    {""},                                                                                   // 61
    {""},                                                                                   // 62
    {""},                                                                                   // 63
    {""},                                                                                   // 64
    {"仪器类", "测控技术与仪器", "智能感知工程", "电气工程及其自动化"},                     // 65
    {""},                                                                                   // 66
    {""},                                                                                   // 67
    {""},                                                                                   // 68
    {""},                                                                                   // 69
    {""},                                                                                   // 70
    {"生物医学科学"},                                                                       // 71
    {""},                                                                                   // 72
    {""},                                                                                   // 73
    {""},                                                                                   // 74
    {"临床医学（一院）", "临床医学（5+3一体化）（一院）", "临床医学（5+3一体化，儿科学）"}, // 75
    {"临床医学（二院）", "临床医学（5+3一体化）（二院）"},                                  // 76
    {"临床医 学（三院）", "临床医学（5+3一体化）（三院）"},                                 // 77
    {""},                                                                                   // 78
    {""},                                                                                   // 79
    {""},                                                                                   // 80
    {"动物医学(农林)", "动物医学(高校专项计划)"},                                           // 81
    {"植物生产", "农学", "园艺", "植物保护", "农业 资源与环境(农林)"},                      // 82
    {""},                                                                                   // 83
    {""},                                                                                   // 84
    {"动物科学(农林)"},                                                                     // 85
    {""},                                                                                   // 86
    {"食品科学与工程", "食品质量与安全"}                                                    // 87
};

int Get_NounArrLen(const char **p) {
    const int szp = sizeof(const char *);
    int arrSize;
    if (p == Institutes)
        arrSize = sizeof(Institutes);
    else if (p == pubCourseCategory)
        arrSize = sizeof(pubCourseCategory);
    else if (p == Course_type)
        arrSize = sizeof(Course_type);
    else if (p == Enroll_retake)
        arrSize = sizeof(Enroll_retake);
    else if (p == Enroll_level)
        arrSize = sizeof(Enroll_level);
    else if (p == Course_nature)
        arrSize = sizeof(Course_nature);
    else if (p == Course_grade_type)
        arrSize = sizeof(Course_grade_type);
    else if (p == Course_exam_type)
        arrSize = sizeof(Course_exam_type);
    return arrSize / szp;
}

#ifndef NULL
#define NULL 0LL
#endif
int getNounIndex(const char **nounArr, int arrLen, const char *content) {
    if (content == NULL)
        return 0;
    for (int i = 0; i < arrLen; i++) {
        if (strcmp(nounArr[i], content) == 0)
            return i;
    }
    return 0;
}