# coding: utf-8
import NewFile
import random
import hashlib
import json
import os
import numpy as np

# Replace 'data.json' with your actual file path
with open("./GetTestData/Courses.json", "r", encoding="utf-8") as f:
    courses = json.load(f)

with open("./GetTestData/__Award.json", "r", encoding='utf-8') as f:
    awards = json.load(f)

with open("./GetTestData/__Essay.json", "r", encoding='utf-8') as f:
    essays = json.load(f)

with open("./GetTestData/__Project.json", "r", encoding='utf-8') as f:
    projects = json.load(f)

StudentNames = [
    "蔡天罡", "高志勇", "赵彭彭", "常俊艾", "贾祺瑞", "陆天空", "余鸿云", "刘奇玮", "范鸿风", "邵哲彦",
    "徐睿博", "卢学文", "郑华容", "萧星津", "漕明德", "江才良", "钟波光", "朱锐藻", "彭志学", "叶英勋",
    "韩俊雅", "曹英纵", "高阳炎", "邱永望", "郑永丰", "石承平", "许茂学", "韩宇荫", "朱建修", "陈俊弼",
    "贺濮存", "叶宏朗", "魏英韶", "程茂才", "漕宏硕", "任开朗", "康开畅", "江学义", "丁勇毅", "任兴庆",
    "夏温韦", "龚高谊", "乔英哲", "崔翰飞", "金升荣", "苏波鸿", "魏飞昂", "叶弘伟", "陆智勇", "韩晗昱",
    "徐鸿雪", "丁博文", "武俊德", "赖鸿运", "常俊雅", "易飞雨", "宋承望", "陈乐音", "林飞语", "罗睿思",
    "董天赋", "林俊明", "杜展鹏", "周景天", "卢自怡", "汤建华", "金自明", "邵华辉", "邓嘉祯", "蒋德本",
    "曾庆生", "杜天韵", "万睿达", "郭俊德", "段玉书", "于光明", "廖彭彭", "白雅懿", "邓奇致", "邱英逸",
    "姚永宁", "白修能", "贾鸿畴", "阎浩思", "王和顺", "孔正青", "马元嘉", "曹正德", "阎德义", "杨成礼",
    "龙永元", "顾宜年", "侯正真", "宋弘扬", "苏子平", "钱奇玮", "马星汉", "邹欣德", "曾鸿振", "张乐和",
    "罗建中", "陈玉宸", "唐鹤轩", "黄乐逸", "周子晋", "潘永贞", "马哲茂", "夏浩初", "陈正初", "魏浩博",
    "钱俊艾", "袁涵润", "孙志泽", "段茂实", "金乐语", "孟锐智", "吴嘉祯", "赖奇迈", "彭睿识", "夏力强",
    "孔信鸥", "许鸿畴", "彭浩旷", "程意蕴", "董茂典", "汪德泽", "唐学义", "傅宏义", "白雪峰", "徐恺乐",
    "沈光赫", "邹文山", "蒋雅达", "孙阳夏", "魏逸春", "丁俊发", "于开诚", "赵俊达", "张俊楠", "冯蕴藉",
    "张兴为", "方阳煦", "余锐智", "唐经国", "武元基", "常鸿福", "赵睿识", "汪俊雄", "于明煦", "曹瀚漠",
    "钱德华", "王星晖", "孙乐逸", "钟良吉", "刘力夫", "胡浩大", "阎博厚", "黄正志", "孙元驹", "宋烨赫",
    "龚德惠", "康俊才", "秦明知", "谢雅志", "熊学民", "陆经略", "尹明煦", "何和玉", "潘和风", "任高峯",
    "田鹏赋", "薛鸿熙", "曹自明", "吴俊豪", "贺茂材", "冯玉成", "金元甲", "白明俊", "杜元青", "叶华清",
    "邱英华", "黄俊良", "武才艺", "白星雨", "萧向文", "石文星", "钟元凯", "杜浩波", "侯文星", "许伟祺",
    "钟宏毅", "梁和畅", "万阳辉", "毛睿才", "黎咏歌", "贺彭勃", "康光远", "秦烨烨", "余文宣", "毛伟泽",
    "马玉成", "魏理群", "高俊名", "曾宜人", "阎嘉颖", "方正阳", "贺兴腾", "文和泰", "史嘉谊", "薛俊良",
    "高嘉良", "郑坚诚", "郭弘方", "孔博实", "叶乐游", "黎明朗", "冯嘉志", "林嘉实", "姚翰墨", "马天罡",
    "王季同", "侯阳波", "秦鸿远", "陈经业", "董自怡", "许蕴和", "钟烨磊", "林烨磊", "叶国安", "郝靖琪",
    "曾元青", "马宏大", "尹星海", "汪煜祺", "叶鸿波", "何飞航", "邱明智", "任修诚", "马乐人", "钟乐圣",
    "傅英卓", "石理群", "武嘉荣", "江阳羽", "薛浩气", "许绍钧", "蔡嘉祥", "魏高峯", "邹子民", "胡天韵",
    "姚心远", "高睿慈", "唐力行", "崔琪睿", "蔡鹏海", "萧泽宇", "萧鸿羽", "邹宏毅", "白志义", "姚才艺",
    "蔡乐逸", "杨阳平", "陈宇达", "贺嘉玉", "杨正文", "苏正信", "任弘光", "于同甫", "叶涵蓄", "常鹏鲲",
    "宋嘉茂", "段宏壮", "苏永贞", "石翰池", "朱宇文", "钱文彦", "汪乐童", "高立人", "文飞掣", "傅弘亮",
    "叶涵涵", "宋高卓", "于鹏赋", "胡兴发", "杨茂德", "张承福", "邵新觉", "曹明煦", "董修谨", "林璞玉",
    "石弘致", "谢涵润", "贺烨烁", "宋明知", "董天韵", "余波涛", "彭正豪", "曾和煦", "丁良畴", "崔经略",
    "萧修德", "乔鹏鲸", "谭文赋", "罗英武", "龚锐泽", "白懿轩", "廖智鑫", "漕乐和", "韩浩宕", "吴经纶",
    "崔睿思", "顾承平", "张弘大", "文子默", "漕高远", "石宏伟", "漕信鸥", "尹阳文", "周睿好", "马溥心",
    "孔德辉", "黄俊人", "漕子墨", "武修平", "贾高昂", "熊嘉珍", "毛华美", "曹高歌", "金国源", "江奇希",
    "徐俊楚", "龙光华", "贾飞驰", "孟德宇", "吕翰飞", "田凯乐", "龚飞文", "顾皓轩", "袁光耀", "石阳飙",
    "姚玉轩", "贾欣怿", "姚茂彦", "阎景龙", "袁正谊", "汪嘉瑞", "王力强", "金明喆", "赵伟毅", "郝天禄",
    "吕兴邦", "杨康宁", "任雨信", "王鹏赋", "郝志学", "苏志勇", "刘博超", "唐绍辉", "余英杰", "毛星雨",
    "夏宜民", "林永丰", "杜浩大", "秦俊发", "董俊侠", "戴嘉胜", "周涵蓄", "李敏才", "熊俊健", "龙浩淼",
    "白阳秋", "曾金鑫", "余弘益", "段智志", "邵思远", "彭鸿熙", "石嘉致", "薛高峻", "郑乐家", "林庆生",
    "刘经武", "韩鹏赋", "姚刚捷", "张波光", "黎雅健", "戴睿博", "任兴庆", "常锐进", "赵飞光", "曹英博",
    "周浩气", "崔志学", "孙宇达", "顾康平", "熊兴言", "吴宜然", "范明亮", "黄新知", "卢兴安", "崔翔宇", "孟朗",
    "孙魏", "叶禅", "顾岩", "段言", "白晸", "吴侪", "潘碫", "张勘", "杨峰", "何稼", "康富", "梁拯",
    "赵辉", "白坤", "夏晨", "姚森", "郑勒", "马翔", "彭密", "石州", "于延", "孙辰", "汤汶", "顾冠",
    "魏平", "何风", "赖会", "漕伟", "周哲", "刘毅", "侯葆", "丁卿", "姜玄", "吴啸", "邱舷", "龚宪",
    "钱鹏", "赵言", "方力", "彭征", "石心", "万桓", "孟征", "孔辰", "熊翰", "常含", "邹瑎", "朱淏",
    "易晴", "江御", "曾江", "顾锋", "廖建", "廖彭", "邹钧", "潘砂", "姚巡", "蒋龄", "傅梁", "杨任",
    "魏达", "许鲲", "杨承", "梁志", "姜帅", "袁晟", "朱冠", "邹江", "程固", "于宗", "梁武", "朱义",
    "彭候", "胡辅", "苏驹", "金震", "漕璟", "黎壮", "宋时", "于濮", "董安", "魏腾", "张鲛", "杜峙",
    "韩蚩", "李庆", "潘智", "程珺", "谢柴", "秦木", "谭勰", "万俊", "范邦", "方镰", "谢桦", "胡帅",
    "孔宪", "郭翔", "钟瑎", "贺布欣", "万代亦", "姚曼青", "漕妍和", "余钰彤", "林庄夏", "冯余馥", "苏菡梅",
    "尹宵月", "林晴曦", "贾忆秋", "段夏柳", "刘品怡", "谭天荷", "田含香", "熊盼曼", "邱孤萍", "张菱华",
    "苏欣欣", "何冰露", "杜姝瑶", "袁秀妮", "武叶芳", "吴寒珊", "傅雅懿", "何惜香", "郑翠安", "金欢欣",
    "邵沛若", "赵仪芳", "丁霞姝", "孔许弋", "武望慕", "漕芮欢", "邵思淼", "段美曼", "顾访烟", "康易梦",
    "曾娅欣", "杨春芳", "范友桃", "方采波", "龙布欣", "贾悦和", "魏优美", "丁白柏", "罗柔婉", "任白亦",
    "胡运菱", "石晴波", "李丽英", "薛悦爱", "李吉玉", "钟如凡", "赵颖慧", "赵嘉禾", "曹恺玲", "熊元风",
    "万晓霜", "梁秀杰", "杨青寒", "李欣彩", "汤静恬", "秦寄琴", "郭文惠", "钟佳悦", "刘倩丽", "林以蓝",
    "王友绿", "魏颐然", "胡流惠", "石许弋", "谭荇怡", "范翠丝", "姚天欣", "姜芮安", "乔含香", "熊书竹",
    "武琦巧", "漕新语", "常安卉", "谢菱华", "郝兰娟", "余琼芳", "杨秀颖", "石欣彤", "杨慕梅", "宋梦桐",
    "谢悠柔", "杜洁静", "孙正思", "孔之桃", "田念柏", "金璟雯", "郭春娇", "朱莉莉", "董怿悦", "方三婷",
    "金元槐", "高莹莹", "夏春岚", "顾小芬", "钱合瑞", "钱初丹", "卢顺慈", "汪青筠", "贾曼容", "金雯琴",
    "林暖暖", "沈婧芸", "漕梧桐", "邹歆美", "丁莞然", "朱冰凡", "李优美", "孟友桃", "黄燕岚", "孔一嘉",
    "袁寄灵", "任雅洁", "罗子爱", "范北嘉", "范婉然", "龙晨星", "范新波", "叶傲白", "徐绮梅", "马清润",
    "魏娅庭", "夏芷兰", "杨灵慧", "毛迎梅", "蔡芸姝", "易麦冬", "易菱华", "邹惠玲", "胡燕岚", "汤哲美",
    "黄翠柔", "梁从露", "张杨柳", "邵念烟", "陆清晖", "邵寒雁", "万雪漫", "谢彩萱", "邱红豆", "石飞雪",
    "廖箫笛", "许博丽", "侯诗桃", "文惜筠", "韩梓菱", "方靖巧", "龙莘莘", "吴运馨", "沈子惠", "万蝶梦",
    "毛月悦", "林梓蓓", "龙珠玉", "萧肖奈", "夏夏瑶", "薛灵仙", "于书语", "胡芳洁", "万代萱", "徐初曼",
    "史千萍", "汪鸣玉", "蒋雪晴", "杜子丹", "吕正平", "刘千叶", "白雅柏", "戴雅霜", "方倩成", "石晨钰",
    "吴寻芳", "陆云飞", "孔仙仪", "廖书慧", "漕慧婕", "唐悦和", "戴子萱", "李秋珊", "龙卓妍", "罗春翠",
    "梁夏寒", "沈明钰", "杨嘉美", "郑庭酪", "邹妙旋", "萧傲丝", "冯素洁", "吴冬雪", "汪清韵", "卢梓蓓",
    "程文姝", "顾秋翠", "谭斯斯", "常粟梅", "宋暮芸", "万映波", "黎米莱", "阎含玉", "蒋尔柳", "高凝琴",
    "薛采波", "金保哲", "康萱彤", "孟智美", "汪西贝", "易锐洁", "魏清浅", "冯曼安", "曾晓霞", "阎幻天",
    "罗小玉", "林宜嘉", "叶初丹", "邵希月", "韩由希", "黎寻凝", "程平宁", "漕端静", "苏清浅", "金滢滢",
    "康绣文", "邓思山", "史佩兰", "宋雁兰", "邵晓筠", "乔雨茹", "侯南露", "谢英慧", "龙甜恬", "董梓颖",
    "周忆丹", "薛抒怀", "萧睿颖", "白语薇", "卢紫翠", "漕冷珍", "钱晓兰", "汤宵雨", "萧素莉", "吕静慧",
    "刘诗珊", "毛书桃", "汪秀君", "石尔柳", "薛北辰", "任小楠", "曹北晶", "邓巧兰", "周听云", "邓流逸",
    "吕倩秀", "田紫玉", "石半芹", "崔秋芸", "龙晨星", "丁寻菱", "龚宵晨", "邓紫夏", "郑媛娜", "侯清嘉",
    "王幼枫", "方睿雪", "杨忆南", "姜昭昭", "林丽英", "薛铃语", "邓睿敏", "黎仲媛", "文婉丽", "张思雁",
    "谭艾玲", "程晓燕", "段春枫", "王珍丽", "侯昭懿", "万恨松", "白夏菡", "吕凌晴", "宋姣妍", "彭紫琼",
    "黄惠心", "许怜菡", "阎奇颖", "余雪艳", "戴秋柳", "程谷蕊", "汤莹莹", "孔柔淑", "曾清华", "马苏弥",
    "罗海雪", "蒋卿月", "卢溪澈", "余绿真", "郝子璇", "孟慈心", "杨暄婷", "马美怡", "常叶农", "高荏苒",
    "郑思山", "谭春芳", "张夏璇", "陈忆秋", "姚友菱", "夏梦桐", "丁平婉", "苏冰海", "林北晶", "周痴梅",
    "李水舞", "赖忆南", "宋姝妍", "沈家欣", "朱凡松", "孔紫蓝", "秦美偲", "许瑶瑾", "田冬梅", "梁玉琲",
    "韩思彤", "于优扬", "吕沛珊", "康爱琴", "孙书芹", "郭方方", "魏洛妃", "谭韵梅", "潘怀萍", "彭梦容",
    "苏梓馨", "常艳芳", "许乃欣", "易琛丽", "王秋灵", "尹昕葳", "周米琪", "马婷旭", "周悠素", "唐溪蓝",
    "潘敏思", "曾兰芝", "阎苏微", "宋依美", "卢淑静", "董尤文", "谭昭懿", "张春晖", "谢青雪", "石铃语",
    "金慧晨", "董文静", "叶舒怀", "石怡婷", "廖妍歌", "尹幻梅", "孙华采", "杜雅柏", "冯佩杉", "冯念柏",
    "尹平蓝", "石瑾琳", "汤秋露", "江一禾", "尹瑶琴", "黎婉慧", "沈问夏", "谢艳芳", "陈智菱", "崔白柏",
    "赖洛凝", "吕笑晴", "顾和美", "徐秀珊", "文蔓菁", "黎歆琳", "董思淼", "卢绣文", "文丽佳", "漕滢渟",
    "薛秀雅", "郭清霁", "赖幻桃", "漕曲静", "邓冰心", "秦小琴", "白思若", "孟晓玉", "熊璇娟", "黎彦珺",
    "钱瑞芬", "邓逸馨", "萧嫦", "戴馡", "易琳", "黄线", "史灵", "廖露", "陈飘", "史凡", "郝柳", "毛荣",
    "姜萍", "马茹", "曾飘", "夏瑗", "高湾", "沈妍", "叶鹃", "石菊", "万琰", "贺风", "林渺", "龚蓝",
    "谭姳", "侯园", "方秋", "袁淞", "段夏", "金婉", "贺黛", "萧线", "孙宜", "秦卿", "李羽", "贺淼",
    "陆蓉", "孟凤", "沈平", "李瑛", "吴炫", "秦欣", "任珆", "赵梦", "吴玉", "林瑾", "于俞", "邹蓓",
    "邓晓", "程昭", "何丝", "邹琳", "吕翠", "夏欢", "邵允", "徐端", "陈霞", "段韵", "康燕", "袁瑾",
    "侯佳", "秦洛", "韩叶", "郭水", "杨霜", "高虹", "邱霞", "卢婵", "石清", "黄珆", "曹玫", "武蕊",
    "孟清", "萧炫", "薛水", "汪颖", "邱草", "罗虹", "邵瑶", "邱莓", "毛姬", "金华", "余卿", "叶平",
    "姜影", "汤波", "金蕊", "潘湾", "罗亿", "范洛", "李璧", "冯霭", "吕俞", "李珴", "梁嫂", "程媛",
    "夏明", "吴碧", "苏华", "姜碧", "薛呤", "唐颖", "文和璧", "邵宏爽", "蔡飞扬", "韩安宁", "卢学博",
    "马昊天", "罗飞翰", "郝睿思", "孟英资", "卢元洲", "崔欣怡", "龚俊名", "谢宏硕", "常永安", "常冠宇",
    "赖凯复", "白弘毅", "于锐锋", "谭永怡", "任博学", "汤德辉", "龚高明", "陆华晖", "何永怡", "梁建安",
    "萧元亮", "傅伟兆", "侯烨磊", "曹明哲", "韩文星", "汤和豫", "张锐立", "袁博涛", "龙睿好", "谭华皓",
    "阎彬彬", "叶弘盛", "康作人", "傅奇水", "宋乐咏", "黎正德", "顾阳飙", "邹景明", "孟俊哲", "邹英哲",
    "陆志新", "袁博雅", "汤子真", "黎俊喆", "于建修", "杨俊喆", "梁安和", "张飞掣", "孔锐精", "潘凯康",
    "苏高洁", "朱志业", "宋弘扬", "顾承运", "马飞昂", "郭凯风", "尹嘉福", "许元亮", "谢高达", "朱曾琪",
    "姜飞文", "沈永逸", "贺英博", "周雪风", "蒋开霁", "刘高超", "卢力强", "田华茂", "汪宜然", "姜修德",
    "余文山", "孟健柏", "方阳曜", "尹俊晤", "薛飞沉", "董兴学", "文明珠", "郝宏大", "朱新霁", "邱明达",
    "钟修谨", "侯弘深", "田安易", "杨正德", "许文昌", "谭志泽", "蔡景山", "漕博文", "段宏扬", "侯宜年",
    "陈智敏", "范嘉誉", "胡飞虎", "何高格", "陈飞翰", "萧俊能", "徐宇航", "范立诚", "戴阳荣", "姚德华",
    "白元恺", "石思聪", "刘锐利", "田良吉", "郭景铄", "邹博学", "黄承嗣", "吴和泽", "胡兴文", "龙永年",
    "谢景天", "任兴怀", "吴坚诚", "钱朋兴", "萧锐立", "龙锐利", "于建元", "钱波涛", "薛弘和", "贾宏毅",
    "丁鸿运", "江高明", "范安顺", "史弘阔", "龙彬郁", "唐兴生", "胡皓轩", "丁光远", "方蕴涵", "傅奇伟",
    "周鸿飞", "陆志义", "康星阑", "薛正初", "杜安志", "陆雅昶", "廖飞鸾", "郭和悌", "孟智勇", "戴俊明",
    "吴弘致", "孟星光", "史阳嘉", "廖伟毅", "罗和歌", "潘雨星", "魏德海", "阎子实", "阎建华", "朱高飞",
    "贺和泰", "钱晋鹏", "姜睿博", "郭弘文", "谢飞翼", "蒋和怡", "郝乐邦", "马锐锋", "冯俊豪", "陆成化",
    "范德惠", "林逸春", "顾经纶", "崔敏叡", "韩子真", "毛俊迈", "刘明珠", "李经艺", "周明远", "林温韦",
    "王涵畅", "张信鸥", "廖刚洁", "郑康适", "杨浩涆", "乔鸿雪", "万昊然", "龚阳飙", "陈英奕", "谭天元",
    "袁鹏翼", "郑俊远", "贺正祥", "段和豫", "萧敏学", "贺兴怀", "郭高懿", "贾奇玮", "于翰林", "孟景胜",
    "潘晟睿", "萧煜祺", "史景焕", "袁德泽", "沈博达", "阎烨伟", "马宏儒", "顾修诚", "龙璞瑜", "熊正豪",
    "秦文耀", "薛华容", "贾乐容", "朱承运", "苏鹏天", "杜星阑", "孟志专", "尹阳云", "孟正平", "许鸿达",
    "于和志", "马皓轩", "王刚毅", "萧奇水", "顾承嗣", "高阳华", "韩浩气", "夏德曜", "高安平", "高华清",
    "萧嘉胜", "毛德运", "姜俊贤", "张阳煦", "杜泰清", "徐兴庆", "文俊雄", "方景澄", "于同和", "邱子安",
    "尹智鑫", "尹阳飙", "孙宏才", "邓风华", "曾建章", "张飞雨", "卢承允", "冯飞英", "宋修能", "陆华清",
    "袁锐达", "傅昊空", "尹元武", "程瀚海", "卢温书", "龙文乐", "谭天华", "吕欣嘉", "魏兴生", "汤玉山",
    "易健柏", "万越彬", "秦晗昱", "傅瀚海", "于高谊", "崔兴文", "魏博容", "萧经业", "曹博远", "杨翔飞",
    "文兴言", "赵景曜", "方飞航", "邱飞飙", "董承德", "张正祥", "夏飞扬", "尹雅惠", "魏志泽", "熊玉宸",
    "薛同甫", "姜永新", "毛宏茂", "邹承安", "张成弘", "黄智志", "程同方", "丁和怡", "董弘博", "熊浩波",
    "蔡俊才", "郑俊美", "孙宏浚", "龚高邈", "贾明珠", "陆越彬", "戴金鑫", "邱瀚海", "范华翰", "罗乐湛",
    "袁俊才", "汪华晖", "熊天佑", "黎峻熙", "龚升荣", "郑志国", "郝承允", "顾冠玉", "漕星汉", "袁文柏",
    "万成业", "任兴运", "秦飞掣", "郑安邦", "文朋义", "谭宜春", "武德佑", "傅明哲", "黎文滨", "郑修明",
    "孟昊焱", "漕英逸", "曹俊驰", "乔承福", "曾景福", "赖建树", "方和泰", "文高昂", "方高爽", "易英达",
    "阎永思", "林嘉福", "刘兴旺", "程英卫", "胡天睿", "汤正雅", "黄信然", "熊光临", "杜元忠", "武元勋",
    "毛建弼", "朱文林", "范泰宁", "金修雅", "夏天逸", "龙瑾瑜", "郑学名", "毛俊力", "何高扬", "许乐安",
    "徐修竹", "许阳平", "郝睿德", "范光明", "陈锐进", "乔飞沉", "许和畅", "唐英朗", "贺天材", "田鸿羽",
    "徐涵映", "高彬彬", "方安歌", "谭季同", "董星海", "曹弘业", "贾俊驰", "张高飞", "冯翰墨", "张弘博",
    "龙文轩", "何高丽", "曹良平", "任正祥", "谭嘉志", "金成弘", "袁元思", "崔雅达", "袁立果", "程承安",
    "汪欣悦", "乔良弼", "胡志文", "萧坚秉", "周烨烁", "于鸿飞", "熊景山", "唐建茗", "龙欣可", "苏才哲",
    "石茂学", "许乐山", "史乐正", "韩鸿宝", "董弘义", "范成天", "陆建柏", "吴嘉运", "易敏智", "秦元纬",
    "钟彬炳", "段绍钧", "金高丽", "谢兴言", "方永逸", "梁亭", "高悍", "廖奇", "毛棋", "常琸", "韩瑜",
    "秦炜", "钟辑", "文宋", "邹修", "吴坚", "武飞", "段仁", "武邦", "蔡飒", "孔世", "杨俯", "魏以",
    "沈勋", "林瀛", "崔东", "沈煊", "方士", "漕乒", "许斌", "孔政", "武尊", "梁宗", "余嗣", "熊墨",
    "贺征", "邹泉", "邱展", "赵诤", "张岩", "邓旭", "郝国", "易宙", "戴悍", "沈茗", "黄僧", "傅行",
    "谢刚", "夏嗣", "曹操", "邹守", "孙腾", "周玚", "钱元", "龚勘", "钟铿", "夏顺", "卢之", "冯弩",
    "段偿", "田震", "蔡旭", "苏僖", "何暠", "蒋晸", "邱乐", "钟黎", "郑佑", "朱帅", "文倧", "程石",
    "叶琳", "魏宪", "彭江", "康和", "王斋", "赖马", "万宁", "刘江", "曹任", "曾冕", "漕虚", "陆仞",
    "何欧", "曾子", "彭政", "傅绮", "毛军", "郑斌", "孟士", "周蚩", "田忠", "沈鲛", "程洲", "杨骢",
    "徐鲛", "曹瀛", "叶渝", "宋晴", "贺广", "钟邶", "林宏", "朱段", "邱绍", "易昊", "常娅彤", "白芮欣",
    "赵双文", "程璇玑", "白桂帆", "黄清馨", "蔡红旭", "戴濡霈", "方文英", "杨文姝", "陈芫华", "魏典雅",
    "崔肖倩", "龚柯洁", "苏若兰", "戴焱霞", "魏顾萌", "萧映波", "谢婉容", "宋妍青", "沈娇洁", "邹傲玉",
    "吴双儿", "黄悦心", "贾兰梦", "马白梦", "黄秀竹", "谢寻文", "钱思莲", "罗恺玲", "吕念芹", "秦晴芳",
    "文平春", "袁新雨", "钟采春", "尹妙菱", "白子悦", "何唱月", "田孟夏", "尹和悌", "汤念露", "梁雁菡",
    "武问丝", "袁娇然", "戴恬然", "黄雪枫", "张雅丽", "廖锦欣", "赖苏格", "蔡彤云", "薛真如", "毛冰双",
    "田冬莲", "马星星", "彭杨柳", "刘明艳", "康银玲", "秦冰香", "史薇歌", "姚闲静", "徐彦珺", "程秀娟",
    "韩瑜英", "钟恬欣", "黎白亦", "姜乐萱", "贺丝柳", "徐丽泽", "方昕葳", "孔杨柳", "崔涵双", "段静丹",
    "周雯华", "陆晏如", "唐嫦娥", "石小妹", "余冬寒", "姚新林", "秦半雪", "丁冷雪", "汪语雪", "康连英",
    "冯寻芳", "钱芳蕙", "崔荣霞", "朱秋双", "赖嘉音", "孙悦畅", "龙暖暖", "魏曼卉", "程世韵", "林湛蓝",
    "朱蕙芸", "袁慧玲", "方乃欣", "吴彩娟", "胡菊芬", "钟胜红", "丁悦爱", "潘碧凡", "魏以轩", "刘笑翠",
    "郝晓旋", "熊新美", "任兰泽", "于妍妍", "沈蕙芸", "董梨落", "徐瑜莉", "石桂华", "李谷蓝", "崔友梅",
    "易依秋", "秦新林", "林娜娜", "叶思莹", "陆海儿", "史丽霞", "丁安蕾", "龚梦菡", "姜慕青", "吕云飞",
    "曹水蓉", "钱乐荷", "蒋皓月", "江宇芳", "李涵菡", "余月明", "廖端雅", "丁诗蕊", "赖蕙若", "叶依珊",
    "曾苏格", "陈惠琴", "彭雅柔", "潘千怡", "邹冷雁", "孔梓婧", "姜慧瑶", "程莹洁", "袁书南", "毛惠美",
    "吴忆翠", "林则悦", "任倩丽", "武玄穆", "卢婷婷", "曾苏弥", "余凝洁", "阎静逸", "汤欣颖", "于旭妍",
    "秦燕楠", "陆如雪", "何白秋", "石琇晶", "周卓然", "尹绿柏", "毛思恩", "周胤雅", "邓暮芸", "叶翠芙",
    "罗慕蕊", "冯香菱", "秦今瑶", "赵云岚", "秦采柳", "漕白梦", "徐月灵", "许孤晴", "潘千柔", "曾幻枫",
    "邱哲妍", "邹梓洁", "陈忆敏", "郭静慧", "魏雅静", "郑红梅", "韩幸瑶", "谢白易", "常歌韵", "陈云水",
    "贾攸然", "魏晶滢", "谭怜寒", "潘静香", "白夜蕾", "阎瑜英", "钱安娴", "武亦旋", "万水彤", "龙可可",
    "杨小溪", "孟涟颖", "汪沛若", "常正妍", "夏真洁", "韩若南", "贺浩文", "何祖萍", "贾忆雪", "董绮菱",
    "汤雅楠", "乔山梅", "毛知慧", "薛亚玲", "龙兰七", "黄米兰", "马思蕊", "任慕儿", "彭优悦", "宋海蓝",
    "邓流婉", "周昕昕", "陆南露", "唐绮艳", "侯思琳", "罗蝾婷", "蔡菲菲", "张安波", "范思美", "陈慧丽",
    "蒋欣笑", "沈书蕾", "叶源源", "郝倩美", "卢语雪", "谭若灵", "叶惠心", "钱听南", "乔绮琴", "康开琼",
    "蒋痴灵", "姜勤琼", "徐国萍", "蒋玲芬", "郝一瑾", "姜冰巧", "文依婷", "傅雨蓉", "沈春柔", "王诗蕊",
    "罗融雪", "李兰月", "谭秋灵", "蔡柯拉", "阎淑慧", "刘娅清", "吕雁兰", "苏布衣", "蒋含蕾", "余幼丝",
    "陆秋阳", "田怡悦", "武秀隽", "杨子菡", "崔涵山", "崔盼盼", "邱惜霜", "姚艳卉", "周八雪", "邹雅致",
    "薛安琪", "钟贞怡", "漕绮思", "彭璞玉", "田代梅", "吕韶丽", "任好慕", "文博丽", "谭天心", "段依霜",
    "胡飞双", "杜易巧", "戴妙梦", "尹桐欣", "尹浅伽", "江紫南", "韩韶丽", "漕觅荷", "傅海萍", "黎白薇",
    "贾梦泽", "江飞薇", "张从南", "杨睿瑶", "侯彤雯", "侯瑶岑", "尹惜文", "贾春兰", "石云露", "常思思",
    "文柳瑾", "胡冰心", "罗萧曼", "贾叶飞", "韩晓蓝", "尹小宸", "方惜文", "范朗宁", "方怀蕊", "曾婉奕",
    "任琬凝", "罗令慧", "方采柳", "金燕肖", "郭清馨", "钟智菱", "于婷然", "秦悦人", "乔瑞绣", "丁泽惠",
    "苏映寒", "谭恨天", "孟初露", "胡艳红", "袁淑然", "龚翠风", "吕梦云", "杜曼文", "方寻文", "萧希恩",
    "唐淑哲", "邓寒天", "胡芷文", "梁亚玲", "薛安安", "毛优扬", "马素莉", "郝云露", "梁安寒", "江琴雪",
    "范之山", "程语蓉", "韩阳曦", "汪兰尹", "易乐荷", "贾慕涵", "孙凝云", "邱灵秀", "黎雪蓉", "赵安波",
    "宋恨真", "吕瑞芝", "何谷玉", "金梓云", "张锦文", "赖梓敏", "贺映真", "熊悦乐", "阎柔婉", "石亦绿",
    "陆冬梅", "杨琳敏", "沈思琳", "朱维娟", "梁雨莹", "吴寻菱", "宋卓逸", "漕丹秋", "袁雨寒", "丁兰芝",
    "叶玄穆", "彭惠琴", "董姣姣", "江晓彤", "张晴霞", "汤白夜", "蔡芳华", "郑隅晖", "秦慕夕", "郭思思",
    "潘红旭", "汤晓燕", "侯红旭", "薛舒怀", "胡逸秀", "康盼夏", "赖谷蓝", "汤哲妍", "徐秋颖", "史凝芙",
    "汪若彤", "刘柔怀", "杜翠曼", "蔡词兮", "卢晗玥", "孙妙可", "谢舒玉", "程寻桃", "高媛女", "韩莘莘",
    "曹梦雨", "曾新之", "李紫槐", "傅若华", "武靓影", "钱怡木", "白晗雨", "叶贤惠", "谢玉", "黄淼", "郑素",
    "姚茗", "王柳", "梁卿", "尹夏", "陆真", "曾妶", "许凡", "曾霄", "刘情", "谭影", "田芃", "田佳",
    "孔越", "沈蓉", "毛咏", "郝姐", "白庄", "任梅", "韩炎", "贺瓶", "林菡", "汪舒", "张英", "任姣",
    "姚菊", "易水", "彭囡", "钟水", "卢嫦", "邵烟", "尹漪", "孔思", "杜芳", "孟林", "熊娣", "熊君",
    "邹巧", "朱芳", "朱姯", "熊明", "姚珠", "薛草", "丁妆", "唐黛", "郝欢", "武亚", "吕瑗", "万香",
    "江亚", "谢柔", "段娇", "夏嫣", "孔星", "马钰", "周倰", "秦漩", "薛萱", "蔡琪", "周澜", "叶丽",
    "韩瑗", "范屏", "易莺", "邓娘", "白蓓", "黄斐", "郭彤", "张婕", "沈喜", "陆涵", "范梦", "罗沁",
    "孙梦", "田偲", "韩湾", "顾碧", "石清", "郑岚", "乔艳", "戴姳", "袁英", "谭蓝", "龚仪", "侯玫",
    "邓宁", "孟柔", "尹菊", "叶贞", "杜倩", "任风", "周林", "潘钗", "何月", "萧思", "杜嫔", "毛炅",
    "蔡彩"
]

random.shuffle(StudentNames)

Professions = [
    [],  # 0
    ["哲学（匡亚明班，拔尖学生培养基地）", "哲学", "社会学", "社会工作", "劳动与社会保障"],  # 1
    ["汉语言文学", "历史学"],  # 2
    ["英语", "俄语", "俄语(高校专项计划)", "西班牙语", "日语", "朝鲜语", "朝鲜语(高校专项计划)"],  # 3
    ["音乐表演(艺术专业)", "绘画(艺术专业)", "设计学", "视觉传达设计", "环境设计", "产品设计(艺术专业)"],  # 4
    ["社会体育指导与管理"],  # 5
    ["经济学类", "经济学", "财政学", "金融学", "国际经济与贸易"],  # 6
    ["法学"],  # 7
    ["政治学与行政学", "国际政治", "行政管理"],  # 8
    [
        "会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
        "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用", "档案学"
    ],  # 9
    ["数学类", "数学与应用数学", "信息与计算科学", "统计学"],  # 10
    ["物理学类", "应用物理学", "核物理", "光电信息科学与工程", "物理学（中外合作办学） "],  # 11
    ["化学类", "应用化学", "材料化学", "高分子材料与工程", "化学工程与工艺"],  # 12
    ["生物科学类", "生物技术", "生物工程类", "生物制药", "药物制剂"],  # 13
    ["机械工程（饶斌班，本研贯通）", "机械工程", "工业工程", "工程力学", "智能制造工程"],  # 14
    ["车辆工程（饶斌班，本研贯通）", "车辆工程", "工业设计", "能源与动力工程"],  # 15
    ["材料类", "材料科学与工程 ", "无机非金属材料工程", "材料成型及控制工程", "材料物理",
     "材料物理(高校专项计划)"],  # 16
    [
        "交通运输类", "交通运输", "交通工程", "汽车服务工程", "道路桥梁与渡河工程", "物流工程",
        "农业机械化及其自动化（饶斌班，本研贯通）", "农业机械化及其自动化", "仿生科学与工程"
    ],  # 17
    ["农林经济管理"],  # 18
    ["电子信息类", "电子信息工程", "电子科学与技术", "微电子 科学与工程", "电子信息科学与技术"],  # 19
    ["通信工程类", "通信工程(国家专项计划)", "信息工程", "空间信息与数字技术", "自动化", "机器人工程"],  # 20
    ["计算机科学与技术", "物联网工程", "网络空间安全"],  # 21
    ["地质类", "地质学", "资源勘查工程", "土地资源管理"],  # 22
    ["勘查技术与工程勘查技术与工程", "地理信息科学", "地球物理学", "测绘工程"],  # 23
    ["土木类", "土木工程", "地质工程"],  # 24
    [
        "水利类", "水文与水资源工程", "地下水科学与工程", "环境科学与工程", "环境科学", "环境工程",
        "环境工程(高校专项计划)", "新能源科学与工程"
    ],  # 25
    [],  # 26
    ["放射医学", "预防医学"],  # 27
    ["药学", "临床药学"],  # 28
    ["康复治疗学", "护理学"],  # 29
    ["经济学（国别与区域经济）", "应用心理学", "经济学（匡亚明班，拔尖学生培养基地 ）", "政治学与行政学政治学与行政学"],  # 30
    [],  # 31
    [],  # 32
    ["口腔医学", "口腔医学（5+3一体化）"],  # 33
    [
        "会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
        "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用", "档案学"
    ],  # 34
    [
        "会计学", "财务管理", "信用管理", "经济学（数量经济）", "工商管理", "市场营销", "人力资源管理",
        "管理科学与工程", "信息管理与信息系统", "工程管理", "物流管理", "大数据管理与应用", "档案学"
    ],  # 35
    ["外交学"],  # 36
    ["新闻传播学类", "新闻学", "广告学", "广播电 视编导"],  # 37
    ["考古学", "文物与博物馆学"],  # 38
    ["马克思主义理论（吕振羽班，本研贯通）", "马克思主义理论", "思想政治教育"],  # 39
    ["人工智能"],  # 40
    [],  # 41
    [],  # 42
    [],  # 43
    [],  # 44
    [],  # 45
    [],  # 46
    [],  # 47
    [],  # 48
    [],  # 49
    [],  # 50
    [],  # 51
    [],  # 52
    [],  # 53
    [],  # 54
    ["软件工程", "数据科学与大数据技术"],  # 55
    [],  # 56
    [],  # 57
    [],  # 58
    [],  # 59
    [],  # 60
    [],  # 61
    [],  # 62
    [],  # 63
    [],  # 64
    ["仪器类", "测控技术与仪器", "智能感知工程", "电气工程及其自动化"],  # 65
    [],  # 66
    [],  # 67
    [],  # 68
    [],  # 69
    [],  # 70
    ["生物医学科学"],  # 71
    [],  # 72
    [],  # 73
    [],  # 74
    ["临床医学（一院）", "临床医学（5+3一体化）（一院）", "临床医学（5+3一体化，儿科学）"],  # 75
    ["临床医学（二院）", "临床医学（5+3一体化）（二院）"],  # 76
    ["临床医 学（三院）", "临床医学（5+3一体化）（三院）"],  # 77
    [],  # 78
    [],  # 79
    [],  # 80
    ["动物医学(农林)", "动物医学(高校专项计划)"],  # 81
    ["植物生产", "农学", "园艺", "植物保护", "农业 资源与环境(农林)"],  # 82
    [],  # 83
    [],  # 84
    ["动物科学(农林)"],  # 85
    [],  # 86
    ["食品科学与工程", "食品质量与安全"]  # 87
]

Institutes = [
    "",  # 0号位置的占位符
    "01-哲学社会学院",  # 1
    "02-文学院",  # 2
    "03-外国语学院",  # 3
    "04-艺术学院",  # 4
    "05-体育学院",  # 5
    "06-经济学院",  # 6
    "07-法学院",  # 7
    "08-行政学院",  # 8
    "09-商学与管理学院B",  # 9
    "10-数学学院",  # 10
    "11-物理学院",  # 11
    "12-化学学院",  # 12
    "13-生命科学学院",  # 13
    "14-机械与航空航天工程学院",  # 14
    "15-汽车工程学院",  # 15
    "16-材料科学与工程学院",  # 16
    "17-交通学院",  # 17
    "18-生物与农业工程学院",  # 18
    "19-电子科学与工程学院",  # 19
    "20-通信工程学院",  # 20
    "21-计算机科学与技术学院",  # 21
    "22-地球科学学院",  # 22
    "23-地球探测科学与技术学院",  # 23
    "24-建设工程学院",  # 24
    "25-新能源与环境学院",  # 25
    "26-金融学院",  # 26
    "27-公共卫生学院",  # 27
    "28-药学院",  # 28
    "29-护理学院",  # 29
    "30-东北亚学院",  # 30
    "",  # 31号位置的占位符
    "",  # 32号位置的占位符
    "33-口腔医学院",  # 33
    "34-商学与管理学院A",  # 34
    "35-商学与管理学院",  # 35
    "36-公共外交学院",  # 36
    "37-新闻与传播学院",  # 37
    "38-考古学院",  # 38
    "39-马克思主义学院",  # 39
    "40-人工智能学院",  # 40
    "",  # 41号位置的占位符
    "",  # 42号位置的占位符
    "",  # 43号位置的占位符
    "",  # 44号位置的占位符
    "",  # 45号位置的占位符
    "",  # 46号位置的占位符
    "",  # 47号位置的占位符
    "",  # 48号位置的占位符
    "",  # 49号位置的占位符
    "50-预科教育学院",  # 50
    "",  # 51号位置的占位符
    "",  # 52号位置的占位符
    "",  # 53号位置的占位符
    "54-应用技术学院",  # 54
    "55-软件学院",  # 55
    "",  # 56号位置的占位符
    "",  # 57号位置的占位符
    "",  # 58号位置的占位符
    "",  # 59号位置的占位符
    "60-国际语言学院",  # 60
    "",  # 61号位置的占位符
    "",  # 62号位置的占位符
    "",  # 63号位置的占位符
    "",  # 64号位置的占位符
    "65-仪器科学与电气工程学院",  # 65
    "",  # 66号位置的占位符
    "",  # 67号位置的占位符
    "",  # 68号位置的占位符
    "",  # 69号位置的占位符
    "70-临床医学院",  # 70
    "71-基础医学院",  # 71
    "",  # 72号位置的占位符
    "",  # 73号位置的占位符
    "",  # 74号位置的占位符
    "75-白求恩第一临床医学院",  # 75
    "76-白求恩第二临床医学院",  # 76
    "77-白求恩第三临床医学院",  # 77
    "",  # 78号位置的占位符
    "79-白求恩医学部",  # 79
    "",  # 80号位置的占位符
    "81-动物医学学院",  # 81
    "82-植物科学学院",  # 82
    "83-军需科技学院",  # 83
    "84-农学部公共教学中心",  # 84
    "85-动物科学学院",  # 85
    "",  # 86号位置的占位符
    "87-食品科学与工程学院",  # 87
    "xz27-学生心理健康指导中心",  # 88
    "J1-军事理论教研室",  # 89
    "90-创新创业教育学院",  # 90
    "91-公共外语教育学院",  # 91
    "92-公共体育教学与研究中心",  # 92
    "93-公共数学教学与研究中心",  # 93
    "94-公共物理教学与研究中心",  # 94
    "95-公共化学教学与研究中心",  # 95
    "96-公共计算机教学与研究中心",  # 96
    "97-机械基础教学与研究中心",  # 97
    "98-艺术教学与研究中心",  # 98
    "99-团委",  # 99号位置的占位符
]
# 军事理论教研室原本记号为J1，为处理方便，记为89
# 学生心理健康指导中心记号为xz27，记为88


def generate_student_id():
    """
    生成一个八位数字的学号
    Returns:
      int: 生成的学号
    """
    # 学院编号不能是以下数字
    invalid_college_codes = [
        0,
        26,
        31,
        32,
        34,
        35,
        41,
        42,
        43,
        44,
        45,
        46,
        47,
        48,
        49,
        50,
        51,
        52,
        53,
        54,
        56,
        57,
        58,
        59,
        60,
        61,
        62,
        63,
        64,
        66,
        67,
        68,
        69,
        70,
        72,
        73,
        74,
        78,
        79,
        80,
        83,
        84,
        86,
    ]
    while True:
        # 随机生成学院编号
        college_code = random.randint(1, 87)
        # 如果学院编号是无效的，则重新生成
        if college_code in invalid_college_codes:
            continue
        # 随机生成年级
        grade = random.randint(20, 23)
        # 随机生成班级
        class_number = random.randint(1, 30)
        # 随机生成学生在班级中的编号
        student_number = random.randint(1, 30)
        # 生成学号
        student_id = (
            f"{college_code:02d}{grade:02d}{class_number:02d}{student_number:02d}"
        )
        return int(student_id)


def choose_major(stu_id):
    instit_num = int(stu_id / 1000000)
    return random.choice(Professions[instit_num])


def extract_grade(stu_id):
    grade = stu_id % 1000000 / 10000
    return int(grade + 2000)


def encrypt(pw):
    md5_hash = hashlib.md5()
    md5_hash.update(str(pw).encode('utf-8'))
    return md5_hash.hexdigest()


def newStudent():
    id = generate_student_id()
    return {
        "姓名": random.choice(StudentNames),
        "学号": id,
        "学院": Institutes[int(id / 1000000)],
        "年级": extract_grade(id),
        "专业": random.choice(Professions[int(id / 1000000)]),
        "所选课程": [],
        "MD5": encrypt(id)
    }


TestData = {"学生": [], "课程": []}

def generate_semester(stu: dict):
    grade = stu["年级"]
    sem = random.randint(grade, 2024)
    return f"{sem}-{sem+1}-{sem%2+1}"


def get_gpa(score):
    """
  根据成绩计算绩点
  Args:
    score: 成绩，可以是浮点数或字符串
  Returns:
    绩点，浮点数
  """

    if isinstance(score, str):
        # 将字符串成绩转换为浮点数
        if score == "优秀":
            score = 95
        elif score == "良好":
            score = 85
        elif score == "中等":
            score = 75
        elif score == "及格":
            score = 65
        else:
            score = 55

    if score < 60:
        gpa = 0.0
    elif score < 64:
        gpa = 1.0
    elif score < 67:
        gpa = 1.3
    elif score < 70:
        gpa = 1.7
    elif score < 74:
        gpa = 2.0
    elif score < 77:
        gpa = 2.3
    elif score < 80:
        gpa = 2.7
    elif score < 84:
        gpa = 3.0
    elif score < 87:
        gpa = 3.3
    elif score < 90:
        gpa = 3.7
    elif score < 94:
        gpa = 4.0
    else:
        gpa = 4.0

    return gpa


def arbitrate():
    weight = [0 for _ in range(8)] + [1, 2]
    random.shuffle(weight)
    return random.choice(weight)


def claimProject(stu, project):
    if "素质加分" not in stu:
        stu["素质加分"] = {}
    if "项目" not in stu["素质加分"]:
        stu["素质加分"]["项目"] = []
    project["成员"] = [stu["姓名"]]
    aut_rest = random.randint(0, 2)
    for _ in range(aut_rest):
        project["成员"].append(random.choice(StudentNames))
    stu["素质加分"]["项目"].append(project)


def claimEssay(stu, essay):
    if "素质加分" not in stu:
        stu["素质加分"] = {}
    if "论文" not in stu["素质加分"]:
        stu["素质加分"]["论文"] = []
    essay["作者"] = [stu["姓名"]]
    aut_rest = random.randint(0, 2)
    for _ in range(aut_rest):
        essay["作者"].append(random.choice(StudentNames))
    stu["素质加分"]["论文"].append(essay)


def claimAward(stu, award):
    if "素质加分" not in stu:
        stu["素质加分"] = {}
    if "竞赛获奖" not in stu["素质加分"]:
        stu["素质加分"]["竞赛获奖"] = []
    stu["素质加分"]["竞赛获奖"].append(award)


for _ in range(1000):
    student = newStudent()
    stu_id = student["学号"]
    crs_num = random.randint(5, 10)
    for __ in range(crs_num):
        crs = random.choice(courses)
        exam_type = crs["显示等级成绩类型"]
        if exam_type == "百分制":
            score = np.random.normal(70, 15)
            while score > 100 or score < 0:
                score = np.random.normal(70, 15)
        else:
            score = random.choice(["优秀", "良好", "中等", "及格", "不及格"])

        gpa = get_gpa(score)
        new_crs = {
            "课程号": crs["课程号"],
            "学年学期": generate_semester(student),
            "总成绩": score,
            "重修重考": random.choice(["初修" for _ in range(8)] + ["重修", "重考"]),
            "是否主修": random.choice(["是", "否"]),
            "绩点": gpa,
            "是否及格": "是" if gpa > 1.0 else "否",
            "是否有效": "是"
        }
        student["所选课程"].append(new_crs)
        if "选课学生学号" not in crs:
            crs["选课学生学号"] = []
        crs["选课学生学号"].append(stu_id)
        crs_exist = False
        if crs not in TestData["课程"]:
            TestData["课程"].append(crs)

    be_cnt = 0
    ess_cnt = arbitrate()
    be_cnt += ess_cnt
    for _ in range(ess_cnt):
        claimEssay(student, random.choice(essays))
    awd_cnt = arbitrate()
    if be_cnt + awd_cnt <= 3:
        be_cnt += awd_cnt
        for _ in range(awd_cnt):
            claimAward(student, random.choice(awards))
    prj_cnt = arbitrate()
    if be_cnt + prj_cnt <= 3:
        be_cnt += prj_cnt
        for _ in range(prj_cnt):
            claimProject(student, random.choice(projects))
    TestData["学生"].append(student)

file_path = NewFile.NewFile("TestData.json")
with open(file_path, "w", encoding='utf-8') as f:
    f.write(json.dumps(TestData, ensure_ascii=False))
